Catalogs/Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаметкиЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыПеренесены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеуспешногоЗавершенияРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеуспешногоЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЛида</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ГлобальныйПоискКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы.
//
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	Если НЕ ДоступноИспользование() Тогда
		Возврат;
	КонецЕсли;
	УстановитьПланГлобальногоПоиска();
	
КонецПроцедуры

// См. обработчик ПриГлобальномПоиске модуля клиентского приложения.
//
Процедура ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска) Экспорт
	
	ПроверитьДобавитьПоискКонвертацияВалют(СтрокаПоиска, ПланПоиска);
	ПроверитьДобавитьПоискИНН(СтрокаПоиска, ПланПоиска);
	ПроверитьДобавитьПоискПоШтрихкодуПечатнойФормы(СтрокаПоиска, ПланПоиска);
	
КонецПроцедуры

// См. обработчик ПриВыбореРезультатаГлобальногоПоиска модуля клиентского приложения.
//
Процедура ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка) Экспорт
	
	Если ЭлементРезультата.ВидПоиска = "ВыполнитьПоискКонтрагентовПоИНН" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("ТекстЗаполнения",
			ЭлементРезультата.Значение));
	ИначеЕсли ЭлементРезультата.ВидПоиска = "ВыполнитьКонвертациюСуммыВВалюте" Тогда
		СтандартнаяОбработка = Ложь;
		ГлобальныйПоискМенеджер().НачатьПоиск(ЭлементРезультата.Значение);
	ИначеЕсли ЭлементРезультата.ВидПоиска = "ВыполнитьПолнотекстовыйПоискКонтактов" Тогда
		ОбработатьВыборРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);
	КонецЕсли;
	
	ВидПоискаСтрокой = "";
	Если ЭлементРезультата.ВидПоиска <> Неопределено Тогда
		ВидПоискаСтрокой = Строка(ЭлементРезультата.ВидПоиска);
	КонецЕсли;
	ГлобальныйПоискВызовСервера.ПриВыбореРезультатаГлобальногоПоиска(ВидПоискаСтрокой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Сценарий_ВыполнитьПолнотекстовыйПоискКонтактов

Процедура ОбработатьВыборРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)
	
	Если ТипЗнч(ЭлементРезультата.Значение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	КонтактнаяИнформация = Неопределено;
	ЭлементРезультата.Значение.Свойство("КонтактнаяИнформация", КонтактнаяИнформация);
	
	Если КонтактнаяИнформация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если КонтактнаяИнформация.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		КонтактнаяИнформацияУНФКлиент.ПозвонитьПоТелефону(
			КонтактнаяИнформация.Представление, КонтактнаяИнформация.Владелец);
	ИначеЕсли КонтактнаяИнформация.Тип = ПредопределенноеЗначение(
		"Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
		УправлениеКонтактнойИнформациейКлиент.СоздатьЭлектронноеПисьмо(
			"", КонтактнаяИнформация.Представление, КонтактнаяИнформация.Тип, КонтактнаяИнформация.Владелец);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СовместимостьВерсийПлатформы

// Глобальный поиск доступен начиная с версии платформы 8.3.15
// Для обхода ошибок проверки конфигурации и ошибок выполнения используется метод Вычислить.

Функция ДоступноИспользование()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
	НеобходимаяВерсияПлатформы = "8.3.15.1";
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсияПлатформы, НеобходимаяВерсияПлатформы) >= 0;
	
КонецФункции

Функция ГлобальныйПоискМенеджер()
	
	Возврат Вычислить("ГлобальныйПоиск");
	
КонецФункции

Функция НовыйПланГлобальногоПоиска()
	
	Возврат Вычислить("Новый ПланГлобальногоПоиска");
	
КонецФункции

Функция СтандартныйВидГлобальногоПоиска()
	
	Возврат Вычислить("СтандартныйВидГлобальногоПоиска");
	
КонецФункции

#КонецОбласти

Процедура УстановитьПланГлобальногоПоиска()
	
	ПроверенныеПоискомМетаданные = Новый Массив;
	ПланПоиска = НовыйПланГлобальногоПоиска();
	
	ДобавитьСтандартныеВидыПоиска(ПланПоиска);
	ДобавитьПоискКонтактов(ПланПоиска, ПроверенныеПоискомМетаданные);
	ДобавитьПолнотекстовыйПоиск(ПланПоиска, ПроверенныеПоискомМетаданные);
	
	ГлобальныйПоискМенеджер().УстановитьПлан(ПланПоиска);
	
КонецПроцедуры

Процедура ДобавитьСтандартныеВидыПоиска(ПланПоиска)
	
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["Выражение"], 10);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["НавигационнаяСсылка"], 10);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["ИзбранноеРаботыПользователя"], 20);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["ИсторияРаботыПользователя"], 30);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["ГлобальныеСтандартныеКоманды"], 40);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["ВсеФункции"], 50);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["МенюФункций"], 60);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["ОбсужденияСистемыВзаимодействия"], 70);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["СообщенияСистемыВзаимодействия"], 80);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["Данные"], 90);
	ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["Справка"], 100);
	
КонецПроцедуры

Процедура ДобавитьПоискКонтактов(ПланПоиска, ИспользуемыеМетаданные)
	
	ИспользуемыеМетаданные.Добавить("Справочник.Лиды");
	ИспользуемыеМетаданные.Добавить("Справочник.КонтактыЛидов");
	ИспользуемыеМетаданные.Добавить("Справочник.КонтактныеЛица");
	ИспользуемыеМетаданные.Добавить("Справочник.Контрагенты");
	
	Если ПланПоиска.Найти("ВыполнитьПолнотекстовыйПоискКонтактов", "ГлобальныйПоискСервер") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокПоиска = 75;
	Фоновый = НЕ ОбщегоНазначенияКлиент.РежимОтладки();
	ПланПоиска.Добавить("ВыполнитьПолнотекстовыйПоискКонтактов", "ГлобальныйПоискСервер", Истина, Фоновый, ПорядокПоиска);
	
КонецПроцедуры

Процедура ДобавитьПолнотекстовыйПоиск(ПланПоиска, ИспользуемыеМетаданные)
	
	ИспользоватьСтандартныйВидПоиска = ИспользуемыеМетаданные.Количество() = 0;
	
	ПланПоиска.Удалить(СтандартныйВидГлобальногоПоиска()["Данные"]);
	ПланПоиска.Удалить("ВыполнитьПолнотекстовыйПоиск", "ГлобальныйПоискСервер");
	
	ПорядокПоиска = 90;
	Если ИспользоватьСтандартныйВидПоиска Тогда
		ПланПоиска.Добавить(СтандартныйВидГлобальногоПоиска()["Данные"], ПорядокПоиска);
	Иначе
		Фоновый = НЕ ОбщегоНазначенияКлиент.РежимОтладки();
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("МетаданныеИсключения", ИспользуемыеМетаданные);
		ПланПоиска.Добавить("ВыполнитьПолнотекстовыйПоиск", "ГлобальныйПоискСервер", Истина, Фоновый, ПорядокПоиска,
			ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДобавитьПоискКонвертацияВалют(Знач СтрокаПоиска, ПланПоиска)
	
	СтрокаПоиска = НРег(СтрокаПоиска);
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	
	СловаПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь);
	
	Если СловаПоиска.Количество() <> 2 Тогда
		Возврат;
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СловаПоиска[0]) Тогда
		ЧислоСтрокой = СловаПоиска[0];
		ВалютаСтрокой = СловаПоиска[1];
	ИначеЕсли СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СловаПоиска[1]) Тогда
		ЧислоСтрокой = СловаПоиска[1];
		ВалютаСтрокой = СловаПоиска[0];
	Иначе
		ЧислоСтрокой = Неопределено;
		ВалютаСтрокой = Неопределено;
	КонецЕсли;
	
	Если ЧислоСтрокой = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодходящаяВалюта = ГлобальныйПоискВызовСервера.НайтиВалютуПоСтроке(ВалютаСтрокой);
	
	Если ПодходящаяВалюта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Сумма", СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧислоСтрокой));
	ДополнительныеПараметры.Вставить("Валюта", ПодходящаяВалюта);
	
	ПланПоиска.Добавить("ВыполнитьКонвертациюСуммыВВалюте", "ГлобальныйПоискСервер", Истина, Ложь, 1,
		ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПроверитьДобавитьПоискИНН(Знач СтрокаПоиска, ПланПоиска)
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	
	ЭтоЮрЛицо = Ложь;
	ЭтоИП = Ложь;
	
	Если РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СтрокаПоиска, Истина, "") Тогда
		ЭтоЮрЛицо = Истина;
	КонецЕсли;
	
	Если НЕ ЭтоЮрЛицо И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СтрокаПоиска, Ложь, "") Тогда
		ЭтоИП = Истина;
	КонецЕсли;
	
	Если НЕ ЭтоИП И НЕ ЭтоЮрЛицо Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИНН", СтрокаПоиска);
	ДополнительныеПараметры.Вставить("ЭтоЮрЛицо", ЭтоЮрЛицо);
	
	ПланПоиска.Добавить("ВыполнитьПоискКонтрагентовПоИНН", "ГлобальныйПоискСервер", Истина, Ложь, 1,
		ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПроверитьДобавитьПоискПоШтрихкодуПечатнойФормы(Знач СтрокаПоиска, ПланПоиска)
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	
	Если Не ШтрихкодированиеПечатныхФормКлиент.СтрокаПохожаНаШтрихкодПечатнойФормы(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	Фоновый = Не ОбщегоНазначенияКлиент.РежимОтладки();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеШтрихкода", СтрокаПоиска);
	
	ПланПоиска.Добавить("ВыполнитьПоискПоШтрихкодуПечатнойФормы", "ГлобальныйПоискСервер", Истина, Фоновый, 1,
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
